{
    "modelTopology": {
      "keras_version": "2.4.0",
      "backend": "tensorflow",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "name": "dense_input",
            "trainable": true,
            "validation_data": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "relu",
            "units": 128,
            "use_bias": true,
            "name": "dense",
            "trainable": true,
            "input_shape": [224, 224, 3]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "activation": "sigmoid",
            "units": 1,
            "use_bias": true,
            "name": "dense_1",
            "trainable": true
          }
        }
      ]
    },
    "weightsManifest": {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [3, 128],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [128, 1],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  }
  